# **Задача 4. Квадраты чисел**

# Напишите программу, которая 
# выводит квадраты чисел от 0 до 10. 
# Для этого используйте цикл for и функцию range.

for i in range(1, 11):
    print()
    for j in range(1,11):
        print(i * j)